app/controllers/domains_controller.rb

SELECT "domains".* FROM "domains"
---
  def index
    @domains = Domain.all

INSERT INTO "domains" ("domain_name", "password_expiration_frequency", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["domain_name", "example.com"], ["password_expiration_frequency", "[FILTERED]"], ["created_at", "2024-05-28 14:10:24.431433"], ["updated_at", "2024-05-28 14:10:24.431433"]]
---
  def create
    @domain = Domain.new(domain_params)

    return render json: @domain, status: :created if @domain.save

SELECT "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 21], ["LIMIT", 1]]
UPDATE "domains" SET "password_expiration_frequency" = $1, "updated_at" = $2 WHERE "domains"."id" = $3  [["password_expiration_frequency", "[FILTERED]"], ["updated_at", "2024-05-28 14:34:14.417668"], ["id", 21]]
---
  def update
    @domain = Domain.find(params[:id])

    return render json: @domain if @domain.update(domain_params)

DELETE FROM "domains" WHERE "domains"."id" = $1  [["id", 63]]
---
  def destroy
    @domain.destroy

SELECT "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 63], ["LIMIT", 1]]
---
  def set_domain
    @domain = Domain.find(params[:id])