app/controllers/mailboxes_controller.rb

  def create
    @mailbox = @domain.mailboxes.new(mailbox_params)

    return render json: @mailbox.as_json(except: [:password]), status: :created if @mailbox.save
---
INSERT INTO "mailboxes" ("domain_id", "username", "password", "scheduled_password_expiration", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    return render json: @mailbox.as_json(except: [:password]) if @mailbox.update(mailbox_params)
---
UPDATE "mailboxes" SET "password" = $1, "updated_at" = $2 WHERE "mailboxes"."id" = $3  [["password", "[FILTERED]"], ["updated_at", "2024-05-28 18:44:39.489872"], ["id", 2]]

  def destroy
    @mailbox.destroy
---
DELETE FROM "mailboxes" WHERE "mailboxes"."id" = $1  [["id", 68]]

  def set_domain
    @domain = Domain.find(params[:domain_id])
---
SELECT "domains".* FROM "domains" WHERE "domains"."id" = $1 LIMIT $2  [["id", 257], ["LIMIT", 1]]

  def set_mailbox
    @mailbox = @domain.mailboxes.find(params[:id])
---
SELECT "mailboxes".* FROM "mailboxes" WHERE "mailboxes"."domain_id" = $1 AND "mailboxes"."id" = $2 LIMIT $3  [["domain_id", 257], ["id", 68], ["LIMIT", 1]]